Book Reference: page 123-165 of **Python for Data Analysis Book by Wes McKinney**

# pandas

- contains data structures and data manipulation tools designed to make data cleaning and analysis fast and easy in Python
- Difference between pandas and numpy:
    - pandas is designed for working with tabular or heterogeneous data
    - Numpy is best suited for working with homogeneous numerical array data
- open source project in 2010

In [1]:
import pandas as pd

# or 
# from pandas import Series, DataFrame

### 2 Workhorse data structures
1. Series
    - is a one-dimensional array-like object containing a sequence of values and an associated array of data labels (index)
    - fixed-length, ordered dict
2. DataFrame
    - represents a rectangular table of data
    - contains an ordered collection of columns (which may be of different value types)
    - has both a row and column index
    - dict of Series sharing the same index

In [2]:
obj = pd.Series([1,2,3,'ha'])
obj

0     1
1     2
2     3
3    ha
dtype: object

In [3]:
obj2 = pd.Series([4, 7, -5, 3])
obj2

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj2.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
# use labels in the index when selecting single values or a set of values
obj2['a']

-5

In [9]:
obj2['d'] = 6

In [10]:
obj2[['c', 'a', 'd']] #c,a,d interpreted as list of indices

c    3
a   -5
d    6
dtype: int64

Numpy-like operations
- filtering with a boolean arra
- scalar multiplication
- applying math functions

In [11]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [12]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [13]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [14]:
# dict-like operations
'b' in obj2

True

In [15]:
# convert Python dict to Series

sdata = {'Ohio': 35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [16]:
# override ordered index through...
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [17]:
# Check for missing or NA 
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [18]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [19]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
# Data alignment feature
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Series' object itself AND Series' index both have names

In [21]:
obj4.name = 'population'

In [22]:
obj4.index.name = 'state'

In [23]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [24]:
obj

0     1
1     2
2     3
3    ha
dtype: object

In [25]:
# Series's index can be altered in-place by assignment
obj.index = ['Jennie', 'Lisa', 'Rose', 'Jisoo']

In [26]:
obj

Jennie     1
Lisa       2
Rose       3
Jisoo     ha
dtype: object

### DataFrame

In [27]:
data = {
    'singer': ['Blackpink', 'NCT', 'Seventeen', 'SF9'],
    'year': [2018, 2017, 2019, 2017],
    'title': ['As If It\'s Your Last', 'Cherry Bomb', 'Fear', 'O Sole Mio']
}

In [28]:
frame = pd.DataFrame(data)

In [29]:
frame

      singer                 title  year
0  Blackpink  As If It's Your Last  2018
1        NCT           Cherry Bomb  2017
2  Seventeen                  Fear  2019
3        SF9            O Sole Mio  2017

In [30]:
frame.head() # displays first five rows

      singer                 title  year
0  Blackpink  As If It's Your Last  2018
1        NCT           Cherry Bomb  2017
2  Seventeen                  Fear  2019
3        SF9            O Sole Mio  2017

In [31]:
pd.DataFrame(data, columns=['year', 'title', 'singer'])

   year                 title     singer
0  2018  As If It's Your Last  Blackpink
1  2017           Cherry Bomb        NCT
2  2019                  Fear  Seventeen
3  2017            O Sole Mio        SF9

In [32]:
frame2 = pd.DataFrame(data, columns=['year', 'title', 'singer', 'rating'], 
            index=['one', 'two', 'three', 'four'])
frame2

       year                 title     singer rating
one    2018  As If It's Your Last  Blackpink    NaN
two    2017           Cherry Bomb        NCT    NaN
three  2019                  Fear  Seventeen    NaN
four   2017            O Sole Mio        SF9    NaN

In [33]:
frame2.columns

Index(['year', 'title', 'singer', 'rating'], dtype='object')

In [34]:
frame2['singer']

one      Blackpink
two            NCT
three    Seventeen
four           SF9
Name: singer, dtype: object

In [35]:
frame2.title # this only works when the column name is a valid Python variable name

one      As If It's Your Last
two               Cherry Bomb
three                    Fear
four               O Sole Mio
Name: title, dtype: object

In [36]:
frame2.loc['three'] #rows

year           2019
title          Fear
singer    Seventeen
rating          NaN
Name: three, dtype: object

Columns can be modified by assignment

In [37]:
frame2['rating'] = 3.5

In [38]:
frame2

       year                 title     singer  rating
one    2018  As If It's Your Last  Blackpink     3.5
two    2017           Cherry Bomb        NCT     3.5
three  2019                  Fear  Seventeen     3.5
four   2017            O Sole Mio        SF9     3.5

In [39]:
frame2['rating'] = np.arange(4.)

In [40]:
frame2

       year                 title     singer  rating
one    2018  As If It's Your Last  Blackpink     0.0
two    2017           Cherry Bomb        NCT     1.0
three  2019                  Fear  Seventeen     2.0
four   2017            O Sole Mio        SF9     3.0

In [41]:
# Series(rating_value's) length must match the length of  the DataFrame
rating_val = pd.Series([4,5], index=['two', 'four'])

In [42]:
frame2['rating'] = rating_val

In [43]:
frame2

       year                 title     singer  rating
one    2018  As If It's Your Last  Blackpink     NaN
two    2017           Cherry Bomb        NCT     4.0
three  2019                  Fear  Seventeen     NaN
four   2017            O Sole Mio        SF9     5.0

In [44]:
# add new column
frame2['girl_group'] = frame2.singer == 'Blackpink'

In [45]:
frame2

       year                 title     singer  rating  girl_group
one    2018  As If It's Your Last  Blackpink     NaN        True
two    2017           Cherry Bomb        NCT     4.0       False
three  2019                  Fear  Seventeen     NaN       False
four   2017            O Sole Mio        SF9     5.0       False

In [46]:
# delete column
del frame2['girl_group']

In [47]:
frame2

       year                 title     singer  rating
one    2018  As If It's Your Last  Blackpink     NaN
two    2017           Cherry Bomb        NCT     4.0
three  2019                  Fear  Seventeen     NaN
four   2017            O Sole Mio        SF9     5.0

In [48]:
frame2.columns

Index(['year', 'title', 'singer', 'rating'], dtype='object')

The column returned from indexing a DataFrame is a view on the
underlying data, not a copy. Thus, any in-place modifications to the
Series will be reflected in the DataFrame. The column can be
explicitly copied with the Seriesâ€™s **copy method**.

In [49]:
# nested dict of dicts
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [50]:
frame3 = pd.DataFrame(pop)

In [51]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [52]:
frame3.T # transpose

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [53]:
frame3['Ohio'][:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [54]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [55]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [56]:
frame2.values # see how dtype is object

array([[2018, "As If It's Your Last", 'Blackpink', nan],
       [2017, 'Cherry Bomb', 'NCT', 4.0],
       [2019, 'Fear', 'Seventeen', nan],
       [2017, 'O Sole Mio', 'SF9', 5.0]], dtype=object)

### Index Objects
    - responsible for holding the axis labels and other metadata
    - immutable
    - fixed-size set
    - can contain duplicate labels

In [57]:
obj = pd.Series(range(3), index=['a','b','c'])
obj

a    0
b    1
c    2
dtype: int64

In [58]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [59]:
index[1:]

Index(['b', 'c'], dtype='object')

In [60]:
# immutable index
index[1] = 'd'

TypeError: Index does not support mutable operations

In [61]:
labels = pd.Index(np.arange(3))

In [62]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [63]:
# Immutability makes it safer to share Index objects among data structures
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [64]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [65]:
obj2.index is labels

True

In [66]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [67]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [68]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [69]:
# duplicate labels
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [70]:
# rename index/column through rename func
frame3.rename(columns={'Nevada':'the nevada'}, inplace=True)

In [71]:
frame3.columns

Index(['the nevada', 'Ohio'], dtype='object', name='state')

### Reindexing
    -An important method on pandas objects is reindex, which means to create a new object with the data conformed to a new index.
    - require that the labels be unique

In [72]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [73]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [74]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [75]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

For ordered data like **time series**, it may be desirable to do some **interpolation or filling of values** when reindexing. The method option allows us to do this, using a method such as ffill, which forward-fills the values

In [76]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [77]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [78]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

With DataFrame, reindex can alter either the (row) index, columns, or both. When
passed only a sequence, it reindexes the rows in the result:

In [79]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
     index=['a', 'c', 'd'],
     columns=['Ohio', 'Texas', 'California'])

In [80]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [81]:
# reindex rows
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [82]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [83]:
# reindex columns
states = ['Texas', 'Utah', 'California']
frame.reindex(columns= states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [84]:
frame.reindex(index=['a', 'b', 'c', 'd'], columns=states)
# see more reindex function arguments to customize

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [85]:
frame2.columns

Index(['Ohio', 'Texas', 'California'], dtype='object')

In [86]:
frame.reindex(columns=['Texas','Utah','California'], fill_value=0)

   Texas  Utah  California
a      1     0           2
c      4     0           5
d      7     0           8

In [87]:
# Dropping Entries from an Axis

In [88]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [89]:
new_obj = obj.drop('c')

In [90]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [91]:
obj.drop(['d', 'c']) 
# drop method will return a new object with the 
# indicated value or values deleted from an axis:

a    0.0
b    1.0
e    4.0
dtype: float64

In [92]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
     index=['Ohio', 'Colorado', 'Utah', 'New York'],
     columns=['one', 'two', 'three', 'four'])

In [93]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [94]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [95]:
# drop values from the columns by passing axis=1 or axis='columns':
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [96]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [97]:
# You can also choose to modify the size or shape of a Series or DataFrame using
# in-place

obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

Be careful with the inplace, as it <span style="color:red">destroys any data that is dropped. </span>

### Indexing, Selection, and Filtering

In [98]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [99]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [100]:
obj['b']

1.0

In [101]:
obj[1]

1.0

In [102]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [103]:
obj['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [104]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [105]:
# Slicing with labels behaves differently than normal Python slicing in 
# that the endpoint is inclusive
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [106]:
# indexing dataframe
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
     index=['Ohio', 'Colorado', 'Utah', 'New York'],
     columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [107]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [108]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [109]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [110]:
data[data['three'] >= 10]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [111]:
# Filtering
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [112]:
data[data < 5] = 0

In [113]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Selection with loc and iloc
    - select a subset of the rows and columns from a DataFrame using
    1. using either axis labels (loc) or
    2. integers (iloc).

In [114]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [115]:
data.iloc[1, [1,2]]

two      5
three    6
Name: Colorado, dtype: int32

In [116]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [117]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

### Integer Indexes

In [118]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

Working with pandas objects indexed by integers is something that often trips up
new users due to some differences with indexing semantics on built-in Python data
structures like lists and tuples. For example, you might not expect the following code
to generate an error:

In [119]:
ser[-1] # ERROR

KeyError: -1

In [120]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [121]:
ser[:1]

0    0.0
dtype: float64

In [122]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [123]:
ser.iloc[:1]

0    0.0
dtype: float64

### Arithmetic and Data Alignment

In [124]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [125]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [126]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [127]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

The internal data alignment introduces missing values in the label locations that donâ€™t
overlap. Missing values will then propagate in further arithmetic computations.

### Arithmetic methods with fill values

In [128]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
 columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [129]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
 columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [130]:
df2.loc[1, 'b'] = np.nan

In [131]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [132]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [133]:
# 1 / df1 is equivalent to df1.rdiv(1)
1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [134]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

### Operations between DataFrame and Series

In [135]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [136]:
arr[0]

array([0., 1., 2., 3.])

In [137]:
arr-arr[0] # broadcasting

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [138]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
     columns=list('bde'),
     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [139]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [140]:
frame - series # series is broadcasted down the rows

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [141]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [142]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If you want to instead broadcast over the columns, matching on the rows, you have to use one of the arithmetic methods. For example:

In [143]:
series3 = frame['d']

In [144]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [145]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [146]:
frame.sub(series3, axis='index') # subtract # broadcast columns

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function Application and Mapping
- NumPy ufuncs (element-wise array methods) also work with pandas objects:

In [152]:
#frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
#     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

frame = pd.DataFrame(np.random.randint(0,100,size=(4, 3)), columns=list('bde'),
     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [153]:
frame

         b   d   e
Utah    43  95  23
Ohio    98  60  56
Texas   53  13  54
Oregon  11  16  85

In [154]:
np.abs(frame)

         b   d   e
Utah    43  95  23
Ohio    98  60  56
Texas   53  13  54
Oregon  11  16  85

In [155]:
f = lambda x:x.max() - x.min()

In [157]:
frame.apply(f) 
# b = 98 - 11
# d = 95 - 13
# e = 85 - 23

b    87
d    82
e    62
dtype: int64

In [159]:
frame.apply(f, axis='columns') # function is applied per row

Utah      72
Ohio      42
Texas     41
Oregon    74
dtype: int64

In [161]:
def f(x):
     return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [162]:
frame.apply(f)

      b   d   e
min  11  13  23
max  98  95  85

In [163]:
# element-wise using applymap
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah    43.00  95.00  23.00
Ohio    98.00  60.00  56.00
Texas   53.00  13.00  54.00
Oregon  11.00  16.00  85.00

The reason for the name applymap is that Series has a map method for applying an
element-wise function

In [164]:
frame['e'].map(format)

Utah      23.00
Ohio      56.00
Texas     54.00
Oregon    85.00
Name: e, dtype: object

### Sorting and Ranking
- sort_index = returns a new, sorted object

In [165]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [166]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [168]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
     index=['three', 'one'],
     columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [169]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [171]:
frame.sort_index(axis=1) # sorts INDEX ascending by default

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [172]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [173]:
obj = pd.Series([4, 7, -3, 2])

In [174]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [175]:
# Any missing values are sorted to the end of the Series by default
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [176]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [177]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [178]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [179]:
# To sort by multiple columns, pass a list of names:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [181]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [182]:
obj.rank() 
# Ranking assigns ranks from one through 
# the number of valid data points in an array

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [183]:
obj.rank(method='first')
# Ranks can also be assigned according to 
# the order in which theyâ€™re observed in the data

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [184]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

### Axis Indexes with Duplicate Labels

In [186]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [187]:
obj.index.is_unique

False

In [188]:
obj['a']

a    0
a    1
dtype: int64

In [190]:
type(obj['a']) # if obj has duplicate labels, this returns a series

pandas.core.series.Series

## Summarizing and Computing Descriptive Statistics
- pandas objects are equipped with a set of common mathematical and statistical methods.
- Most of these fall into the category of 
    1. reduction methods
    2. summary statistics methods 
        - ex. sum or mean
- Compared with the similar methods found on NumPy arrays, they have **built-in handling for missing data.**

In [191]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
     [np.nan, np.nan], [0.75, -1.3]],
     index=['a', 'b', 'c', 'd'],
     columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [192]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [193]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

NA values are excluded unless the entire slice (row or column in this case) is NA. This can be disabled with the skipna option:

In [195]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [197]:
df.idxmax() # returns index of the max num

one    b
two    d
dtype: object

In [198]:
# accumukations
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [199]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [202]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [203]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

In [205]:
import pandas_datareader.data as web

In [210]:
#Letâ€™s consider some DataFrames of stock prices and volumes obtained
#from Yahoo! Finance using the add-on pandas-datareader package
all_data = {ticker: web.get_data_yahoo(ticker)
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
all_data

{'AAPL':                   High         Low        Open       Close      Volume  \
 Date
 2014-10-23  105.050003  103.629997  104.080002  104.830002  71074700.0
 2014-10-24  105.489998  104.529999  105.180000  105.220001  47053900.0
 2014-10-27  105.480003  104.699997  104.849998  105.110001  34187700.0
 2014-10-28  106.739998  105.349998  105.400002  106.739998  48060900.0
 2014-10-29  107.370003  106.360001  106.650002  107.339996  52687900.0
 2014-10-30  107.349998  105.900002  106.959999  106.980003  40654800.0
 2014-10-31  108.040001  107.209999  108.010002  108.000000  44639300.0
 2014-11-03  110.300003  108.010002  108.220001  109.400002  52282600.0
 2014-11-04  109.489998  107.720001  109.360001  108.599998  41574400.0
 2014-11-05  109.300003  108.129997  109.099998  108.860001  37435900.0
 2014-11-06  108.790001  107.800003  108.599998  108.699997  34968500.0
 2014-11-07  109.320000  108.550003  108.750000  109.010002  33691500.0
 2014-11-10  109.330002  108.669998  109.019997  108.830002  27195500.0
 2014-11-11  109.750000  108.400002  108.699997  109.699997  27442300.0
 2014-11-12  111.430000  109.370003  109.379997  111.250000  46942400.0
 2014-11-13  113.449997  111.599998  111.800003  112.820000  59522900.0
 2014-11-14  114.190002  111.209999  113.150002  114.180000  44063600.0
 2014-11-17  117.279999  113.300003  114.269997  113.989998  46746700.0
 2014-11-18  115.690002  113.889999  113.940002  115.470001  44224000.0
 2014-11-19  115.739998  113.800003  115.440002  114.669998  41869200.0
 2014-11-20  116.860001  114.849998  114.910004  116.309998  43395500.0
 2014-11-21  117.570000  116.029999  117.510002  116.470001  57179300.0
 2014-11-24  118.769997  116.620003  116.849998  118.629997  47450800.0
 2014-11-25  119.750000  117.449997  119.070000  117.599998  68840400.0
 2014-11-26  119.099998  117.830002  117.940002  119.000000  40768300.0
 2014-11-28  119.400002  118.050003  119.269997  118.930000  24814400.0
 2014-12-01  119.250000  111.269997  118.809998  115.070000  83814000.0
 2014-12-02  115.750000  112.750000  113.500000  114.629997  59348900.0
 2014-12-03  116.349998  115.110001  115.750000  115.930000  43063400.0
 2014-12-04  117.199997  115.290001  115.769997  115.489998  42044500.0
 ...                ...         ...         ...         ...         ...
 2019-09-11  223.710007  217.729996  218.070007  223.589996  44289600.0
 2019-09-12  226.419998  222.860001  224.800003  223.089996  32226700.0
 2019-09-13  220.789993  217.020004  220.000000  218.750000  39763300.0
 2019-09-16  220.130005  217.559998  217.729996  219.899994  21158100.0
 2019-09-17  220.820007  219.119995  219.960007  220.699997  18318700.0
 2019-09-18  222.850006  219.440002  221.059998  222.770004  25340000.0
 2019-09-19  223.759995  220.369995  222.009995  220.960007  22060600.0
 2019-09-20  222.559998  217.470001  221.380005  217.729996  55413100.0
 2019-09-23  219.839996  217.649994  218.949997  218.720001  19165500.0
 2019-09-24  222.490005  217.190002  221.029999  217.679993  31190800.0
 2019-09-25  221.500000  217.139999  218.550003  221.029999  21903400.0
 2019-09-26  220.940002  218.830002  220.000000  219.889999  18833500.0
 2019-09-27  220.960007  217.279999  220.539993  218.820007  25352000.0
 2019-09-30  224.580002  220.789993  220.899994  223.970001  25977400.0
 2019-10-01  228.220001  224.199997  225.070007  224.589996  34805800.0
 2019-10-02  223.580002  217.929993  223.059998  218.960007  34612300.0
 2019-10-03  220.960007  215.130005  218.429993  220.820007  28606500.0
 2019-10-04  227.490005  223.889999  225.639999  227.009995  34619700.0
 2019-10-07  229.929993  225.839996  226.270004  227.059998  30576500.0
 2019-10-08  228.059998  224.330002  225.820007  224.399994  27955000.0
 2019-10-09  227.789993  225.639999  227.029999  227.029999  18692600.0
 2019-10-10  230.440002  227.300003  227.929993  230.089996  28253400.0
 2019-10-11  237.639999  232.309998  232.949997  236.210007  41698900.0
 2019-10-14  238.130005  234.669998  234.899994  235.869995  24106900.0
 2019-10-15  237.649994  234.880005  236.389999  235.320007  21840000.0
 2019-10-16  235.240005  233.199997  233.369995  234.369995  18475800.0
 2019-10-17  236.149994  233.520004  235.089996  235.279999  16896300.0
 2019-10-18  237.580002  234.289993  234.589996  236.410004  24358400.0
 2019-10-21  240.990005  237.320007  237.520004  240.509995  21811800.0
 2019-10-22  242.199997  239.619995  241.160004  239.960007  20573400.0

              Adj Close
 Date
 2014-10-23   96.191689
 2014-10-24   96.549545
 2014-10-27   96.448616
 2014-10-28   97.944298
 2014-10-29   98.494850
 2014-10-30   98.164513
 2014-10-31   99.100471
 2014-11-03  100.385109
 2014-11-04   99.651047
 2014-11-05   99.889618
 2014-11-06  100.175293
 2014-11-07  100.460983
 2014-11-10  100.295105
 2014-11-11  101.096870
 2014-11-12  102.525322
 2014-11-13  103.972198
 2014-11-14  105.225540
 2014-11-17  105.050430
 2014-11-18  106.414368
 2014-11-19  105.677094
 2014-11-20  107.188477
 2014-11-21  107.335945
 2014-11-24  109.326523
 2014-11-25  108.377327
 2014-11-26  109.667534
 2014-11-28  109.603027
 2014-12-01  106.045738
 2014-12-02  105.640228
 2014-12-03  106.838287
 2014-12-04  106.432808
 ...                ...
 2019-09-11  223.589996
 2019-09-12  223.089996
 2019-09-13  218.750000
 2019-09-16  219.899994
 2019-09-17  220.699997
 2019-09-18  222.770004
 2019-09-19  220.960007
 2019-09-20  217.729996
 2019-09-23  218.720001
 2019-09-24  217.679993
 2019-09-25  221.029999
 2019-09-26  219.889999
 2019-09-27  218.820007
 2019-09-30  223.970001
 2019-10-01  224.589996
 2019-10-02  218.960007
 2019-10-03  220.820007
 2019-10-04  227.009995
 2019-10-07  227.059998
 2019-10-08  224.399994
 2019-10-09  227.029999
 2019-10-10  230.089996
 2019-10-11  236.210007
 2019-10-14  235.869995
 2019-10-15  235.320007
 2019-10-16  234.369995
 2019-10-17  235.279999
 2019-10-18  236.410004
 2019-10-21  240.509995
 2019-10-22  239.960007

 [1258 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close     Volume  \
 Date
 2014-10-23   545.721741   534.382874   537.843323   542.490601  2348800.0
 2014-10-24   543.388123   534.322998   542.869568   538.302063  1973100.0
 2014-10-27   542.919434   535.559631   535.559631   539.289368  1185300.0
 2014-10-28   547.476929   540.137024   541.513306   547.397095  1270900.0
 2014-10-29   552.672607   545.482361   548.494080   547.825928  1770500.0
 2014-10-30   551.286438   542.021851   547.446960   548.803284  1455600.0
 2014-10-31   558.037903   553.231079   557.818481   557.549255  2035000.0
 2014-11-03   556.372498   551.715271   553.979065   553.699829  1382200.0
 2014-11-04   553.979065   547.796021   551.485901   552.592834  1244200.0
 2014-11-05   555.275513   542.560425   555.275513   544.425293  2032200.0
 2014-11-06   545.387634   539.488831   544.006409   540.555908  1333200.0
 2014-11-07   544.714478   537.195129   544.714478   539.528748  1633700.0
 2014-11-10   548.085205   539.538696   539.977478   545.990967  1134600.0
 2014-11-11   550.428772   544.804260   546.988220   548.783325   965500.0
 2014-11-12   548.952820   543.677307   548.883057   545.811462  1129600.0
 2014-11-13   548.294678   541.991943   548.294678   543.886780  1339300.0
 2014-11-14   545.183228   540.665588   545.183228   542.909424  1289500.0
 2014-11-17   542.301086   532.598755   542.091675   535.041016  1726000.0
 2014-11-18   540.456177   532.707458   536.028320   533.565125  1962600.0
 2014-11-19   536.766296   528.628662   533.535156   535.519714  1392200.0
 2014-11-20   533.644897   529.625916   529.795471   533.365662  1563300.0
 2014-11-21   540.655640   535.090881   540.127075   536.028320  2224200.0
 2014-11-24   541.214111   534.153503   536.177917   537.793518  1706300.0
 2014-11-25   542.490601   537.127319   537.524231   539.598511  1789900.0
 2014-11-26   540.067261   535.571594   539.399109   538.890503  1522900.0
 2014-11-28   540.515991   535.130798   539.139771   540.346497  1148300.0
 2014-12-01   539.927612   530.403748   537.424500   532.338440  2115300.0
 2014-12-02   534.033813   528.349426   532.049255   532.288574  1526600.0
 2014-12-03   534.528442   527.810913   529.984924   529.865234  1277900.0
 2014-12-04   535.868774   527.142700   529.705688   535.838867  1392100.0
 ...                 ...          ...          ...          ...        ...
 2019-09-11  1222.599976  1202.199951  1203.410034  1220.170044  1307000.0
 2019-09-12  1241.859985  1223.020020  1224.300049  1234.250000  1725900.0
 2019-09-13  1240.880005  1227.010010  1231.349976  1239.560059  1301400.0
 2019-09-16  1239.560059  1225.609985  1229.520020  1231.300049  1053300.0
 2019-09-17  1235.000000  1223.689941  1230.400024  1229.150024   955100.0
 2019-09-18  1235.609985  1216.530029  1227.510010  1232.410034  1135100.0
 2019-09-19  1244.439941  1232.020020  1232.060059  1238.709961   996000.0
 2019-09-20  1243.319946  1223.079956  1233.119995  1229.930054  2270000.0
 2019-09-23  1239.089966  1224.170044  1226.000000  1234.030029  1062400.0
 2019-09-24  1246.739990  1210.680054  1240.000000  1218.760010  1583200.0
 2019-09-25  1248.300049  1210.089966  1215.819946  1246.520020  1453000.0
 2019-09-26  1245.000000  1232.267944  1241.959961  1241.390015  1538000.0
 2019-09-27  1244.020020  1214.449951  1243.010010  1225.089966  1353900.0
 2019-09-30  1226.000000  1212.300049  1220.969971  1219.000000  1404100.0
 2019-10-01  1231.229980  1203.579956  1219.000000  1205.099976  1273500.0
 2019-10-02  1196.979980  1171.290039  1196.979980  1176.630005  1615100.0
 2019-10-03  1189.060059  1162.430054  1180.000000  1187.829956  1621200.0
 2019-10-04  1211.439941  1189.170044  1191.890015  1209.000000  1162400.0
 2019-10-07  1218.203979  1203.750000  1204.400024  1207.680054   842900.0
 2019-10-08  1206.079956  1189.010010  1197.589966  1189.130005  1039300.0
 2019-10-09  1208.349976  1197.630005  1199.349976  1202.310059   867700.0
 2019-10-10  1215.000000  1197.339966  1198.579956  1208.670044   846600.0
 2019-10-11  1228.390015  1213.739990  1222.209961  1215.449951  1272700.0
 2019-10-14  1226.329956  1211.760010  1212.339966  1217.140015   867500.0
 2019-10-15  1247.329956  1220.400024  1220.400024  1243.010010  1381700.0
 2019-10-16  1254.739990  1238.449951  1241.170044  1243.640015  1094600.0
 2019-10-17  1263.324951  1249.939941  1250.930054  1253.069946   952400.0
 2019-10-18  1258.890015  1241.079956  1253.459961  1245.489990  1352800.0
 2019-10-21  1254.629028  1240.599976  1252.260010  1246.150024  1027200.0
 2019-10-22  1250.599976  1241.380005  1247.849976  1242.800049  1023800.0

               Adj Close
 Date
 2014-10-23   542.490601
 2014-10-24   538.302063
 2014-10-27   539.289368
 2014-10-28   547.397095
 2014-10-29   547.825928
 2014-10-30   548.803284
 2014-10-31   557.549255
 2014-11-03   553.699829
 2014-11-04   552.592834
 2014-11-05   544.425293
 2014-11-06   540.555908
 2014-11-07   539.528748
 2014-11-10   545.990967
 2014-11-11   548.783325
 2014-11-12   545.811462
 2014-11-13   543.886780
 2014-11-14   542.909424
 2014-11-17   535.041016
 2014-11-18   533.565125
 2014-11-19   535.519714
 2014-11-20   533.365662
 2014-11-21   536.028320
 2014-11-24   537.793518
 2014-11-25   539.598511
 2014-11-26   538.890503
 2014-11-28   540.346497
 2014-12-01   532.338440
 2014-12-02   532.288574
 2014-12-03   529.865234
 2014-12-04   535.838867
 ...                 ...
 2019-09-11  1220.170044
 2019-09-12  1234.250000
 2019-09-13  1239.560059
 2019-09-16  1231.300049
 2019-09-17  1229.150024
 2019-09-18  1232.410034
 2019-09-19  1238.709961
 2019-09-20  1229.930054
 2019-09-23  1234.030029
 2019-09-24  1218.760010
 2019-09-25  1246.520020
 2019-09-26  1241.390015
 2019-09-27  1225.089966
 2019-09-30  1219.000000
 2019-10-01  1205.099976
 2019-10-02  1176.630005
 2019-10-03  1187.829956
 2019-10-04  1209.000000
 2019-10-07  1207.680054
 2019-10-08  1189.130005
 2019-10-09  1202.310059
 2019-10-10  1208.670044
 2019-10-11  1215.449951
 2019-10-14  1217.140015
 2019-10-15  1243.010010
 2019-10-16  1243.640015
 2019-10-17  1253.069946
 2019-10-18  1245.489990
 2019-10-21  1246.150024
 2019-10-22  1242.800049

 [1258 rows x 6 columns],
 'IBM':                   High         Low        Open       Close      Volume  \
 Date
 2014-10-23  162.830002  161.539993  162.119995  162.179993   7599400.0
 2014-10-24  162.440002  161.449997  162.080002  162.080002   6652100.0
 2014-10-27  162.910004  161.809998  162.000000  161.869995   4989100.0
 2014-10-28  163.600006  161.800003  162.000000  163.600006   7895300.0
 2014-10-29  164.619995  162.759995  164.330002  163.460007   4739300.0
 2014-10-30  164.619995  163.020004  163.500000  164.350006   3896000.0
 2014-10-31  165.589996  163.619995  165.479996  164.399994   5818000.0
 2014-11-03  164.539993  163.380005  164.250000  164.360001   4688200.0
 2014-11-04  164.360001  162.240005  164.339996  162.649994   4246900.0
 2014-11-05  163.539993  161.559998  163.130005  161.820007   4104700.0
 2014-11-06  161.529999  160.050003  161.279999  161.460007   4067600.0
 2014-11-07  162.210007  160.850006  161.419998  162.070007   3494800.0
 2014-11-10  164.470001  161.610001  161.899994  163.490005   4958200.0
 2014-11-11  163.899994  162.600006  163.699997  163.300003   3534400.0
 2014-11-12  163.000000  161.759995  162.279999  161.919998   3378200.0
 2014-11-13  162.800003  161.800003  162.000000  162.789993   3239700.0
 2014-11-14  164.490005  161.690002  162.100006  164.160004   4978400.0
 2014-11-17  164.970001  163.720001  164.160004  164.160004   4798900.0
 2014-11-18  164.750000  161.889999  164.729996  161.889999   5410100.0
 2014-11-19  162.100006  160.960007  162.050003  161.429993   3802600.0
 2014-11-20  161.500000  159.800003  160.949997  160.639999   4183100.0
 2014-11-21  161.949997  160.750000  161.830002  160.919998   4076900.0
 2014-11-24  163.860001  161.059998  161.539993  162.149994   6619000.0
 2014-11-25  163.500000  161.559998  162.649994  161.759995   4062400.0
 2014-11-26  162.100006  161.009995  161.929993  161.949997   3966000.0
 2014-11-28  163.369995  161.440002  162.750000  162.169998   2405500.0
 2014-12-01  163.320007  161.350006  161.639999  161.539993   4168400.0
 2014-12-02  162.729996  161.639999  162.470001  162.669998   3465700.0
 2014-12-03  164.520004  162.000000  162.470001  164.520004   6429100.0
 2014-12-04  164.500000  163.009995  164.009995  164.050003   3859400.0
 ...                ...         ...         ...         ...         ...
 2019-09-11  145.119995  142.710007  144.850006  143.600006   3869700.0
 2019-09-12  144.039993  141.880005  144.029999  143.619995   2505400.0
 2019-09-13  144.649994  143.259995  144.320007  143.669998   2206600.0
 2019-09-16  143.639999  142.270004  142.559998  142.479996   1928500.0
 2019-09-17  142.479996  140.660004  142.479996  142.199997   2933200.0
 2019-09-18  142.300003  140.509995  142.050003  142.220001   1983600.0
 2019-09-19  145.029999  142.449997  142.460007  142.970001   3089900.0
 2019-09-20  143.830002  141.820007  143.250000  141.880005   5193400.0
 2019-09-23  142.220001  140.559998  141.190002  142.070007   1817900.0
 2019-09-24  142.889999  141.070007  142.500000  141.679993   3231600.0
 2019-09-25  143.630005  140.860001  141.740005  143.160004   2526700.0
 2019-09-26  143.880005  141.410004  143.169998  143.550003   2309800.0
 2019-09-27  145.089996  142.380005  144.410004  143.240005   2356800.0
 2019-09-30  146.570007  143.729996  143.729996  145.419998   3988400.0
 2019-10-01  147.350006  143.539993  145.589996  143.660004   2960800.0
 2019-10-02  142.270004  140.570007  142.190002  141.690002   3340800.0
 2019-10-03  142.070007  139.179993  141.619995  142.020004   2928800.0
 2019-10-04  143.059998  141.029999  142.059998  142.990005   2413600.0
 2019-10-07  142.699997  141.220001  142.259995  141.279999   2426500.0
 2019-10-08  140.470001  138.250000  140.240005  138.380005   3225400.0
 2019-10-09  140.330002  138.789993  139.770004  139.669998   2620800.0
 2019-10-10  141.779999  139.559998  139.770004  141.130005   2593700.0
 2019-10-11  144.500000  142.610001  142.770004  142.759995   2996800.0
 2019-10-14  142.429993  141.320007  142.309998  142.039993   2309500.0
 2019-10-15  143.720001  141.809998  142.539993  143.000000   3025500.0
 2019-10-16  142.949997  141.389999  142.490005  142.110001   5332600.0
 2019-10-17  136.000000  132.910004  135.000000  134.259995  15759800.0
 2019-10-18  134.490005  132.250000  134.220001  134.089996   7177500.0
 2019-10-21  133.100006  130.899994  132.610001  132.580002   6306100.0
 2019-10-22  134.050003  131.610001  132.550003  133.960007   4161600.0

              Adj Close
 Date
 2014-10-23  131.332458
 2014-10-24  131.251480
 2014-10-27  131.081451
 2014-10-28  132.482391
 2014-10-29  132.369003
 2014-10-30  133.089706
 2014-10-31  133.130219
 2014-11-03  133.097809
 2014-11-04  131.713089
 2014-11-05  131.040939
 2014-11-06  131.644287
 2014-11-07  132.141617
 2014-11-10  133.299408
 2014-11-11  133.144485
 2014-11-12  132.019318
 2014-11-13  132.728683
 2014-11-14  133.845688
 2014-11-17  133.845688
 2014-11-18  131.994904
 2014-11-19  131.619797
 2014-11-20  130.975677
 2014-11-21  131.204025
 2014-11-24  132.206879
 2014-11-25  131.888885
 2014-11-26  132.043823
 2014-11-28  132.223190
 2014-12-01  131.709473
 2014-12-02  132.630859
 2014-12-03  134.139236
 2014-12-04  133.756027
 ...                ...
 2019-09-11  143.600006
 2019-09-12  143.619995
 2019-09-13  143.669998
 2019-09-16  142.479996
 2019-09-17  142.199997
 2019-09-18  142.220001
 2019-09-19  142.970001
 2019-09-20  141.880005
 2019-09-23  142.070007
 2019-09-24  141.679993
 2019-09-25  143.160004
 2019-09-26  143.550003
 2019-09-27  143.240005
 2019-09-30  145.419998
 2019-10-01  143.660004
 2019-10-02  141.690002
 2019-10-03  142.020004
 2019-10-04  142.990005
 2019-10-07  141.279999
 2019-10-08  138.380005
 2019-10-09  139.669998
 2019-10-10  141.130005
 2019-10-11  142.759995
 2019-10-14  142.039993
 2019-10-15  143.000000
 2019-10-16  142.110001
 2019-10-17  134.259995
 2019-10-18  134.089996
 2019-10-21  132.580002
 2019-10-22  133.960007

 [1258 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close      Volume  \
 Date
 2014-10-23   45.450001   44.529999   44.619999   45.020000  45451900.0
 2014-10-24   46.900002   45.180000   46.830002   46.130001  61076700.0
 2014-10-27   46.099998   45.709999   45.709999   45.910000  30371300.0
 2014-10-28   46.500000   45.770000   45.860001   46.490002  29049800.0
 2014-10-29   46.700001   46.340000   46.439999   46.619999  30276100.0
 2014-10-30   46.320000   45.770000   46.320000   46.049999  30073900.0
 2014-10-31   46.970001   46.480000   46.939999   46.950001  35849700.0
 2014-11-03   47.459999   46.730000   46.889999   47.439999  23130400.0
 2014-11-04   47.730000   47.250000   47.299999   47.570000  21530800.0
 2014-11-05   47.900002   47.259998   47.799999   47.860001  22449600.0
 2014-11-06   48.860001   47.790001   47.860001   48.700001  33037800.0
 2014-11-07   48.919998   48.290001   48.919998   48.680000  28000600.0
 2014-11-10   49.150002   48.549999   48.650002   48.889999  36370100.0
 2014-11-11   48.950001   48.650002   48.849998   48.869999  23445200.0
 2014-11-12   48.919998   48.520000   48.560001   48.779999  22722100.0
 2014-11-13   49.650002   48.709999   48.810001   49.610001  26210400.0
 2014-11-14   50.049999   49.389999   49.740002   49.580002  29081700.0
 2014-11-17   49.709999   49.139999   49.410000   49.459999  30318600.0
 2014-11-18   49.330002   48.700001   49.130001   48.740002  23995500.0
 2014-11-19   48.750000   47.930000   48.660000   48.220001  26177500.0
 2014-11-20   48.700001   47.869999   48.000000   48.700001  21510600.0
 2014-11-21   49.049999   47.570000   49.020000   47.980000  42884800.0

In [207]:
price = pd.DataFrame({ticker: data['Adj Close']
for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
for ticker, data in all_data.items()})

In [208]:
returns = price.pct_change()

In [209]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2019-10-16 -0.004037  0.000507 -0.006224 -0.008194
2019-10-17  0.003883  0.007583 -0.055239 -0.005128
2019-10-18  0.004803 -0.006049 -0.001266 -0.016322
2019-10-21  0.017343  0.000530 -0.011261  0.007423
2019-10-22 -0.002287 -0.002688  0.010409 -0.014881

In [211]:
returns['MSFT'].corr(returns['IBM'])

0.4857547622770841

In [212]:
returns['MSFT'].cov(returns['IBM'])

9.373066217181849e-05

In [213]:
returns.MSFT.corr(returns.IBM)

0.4857547622770841

In [214]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.520430  0.405388  0.572492
GOOG  0.520430  1.000000  0.412871  0.654075
IBM   0.405388  0.412871  1.000000  0.485755
MSFT  0.572492  0.654075  0.485755  1.000000

In [215]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000246  0.000124  0.000083  0.000133
GOOG  0.000124  0.000230  0.000082  0.000147
IBM   0.000083  0.000082  0.000170  0.000094
MSFT  0.000133  0.000147  0.000094  0.000219

In [216]:
returns.corrwith(returns.IBM)

AAPL    0.405388
GOOG    0.412871
IBM     1.000000
MSFT    0.485755
dtype: float64

In [217]:
returns.corrwith(volume)

AAPL   -0.117577
GOOG   -0.007961
IBM    -0.131030
MSFT   -0.083117
dtype: float64

### Unique Values, Value Counts, and Membership

In [234]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [235]:
uniques = obj.unique()

In [236]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [237]:
type(uniques)

numpy.ndarray

In [238]:
uniques.sort()
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [239]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [240]:
pd.value_counts(obj.values, sort=False)

a    3
d    1
c    3
b    2
dtype: int64

In [241]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [242]:
mask = obj.isin(['b','c'])

In [243]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [244]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [247]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
pd.Index(unique_vals).get_indexer(to_match)
# returns matched indices for each to_match value 
# 0 if to_match_val == c
# 1 if to_match_val == b
# 2 if to_match_val == a

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [251]:
# histogram
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
     'Qu2': [2, 3, 1, 2, 3],
     'Qu3': [1, 5, 2, 4, 4]})

In [252]:
result = data.apply(pd.value_counts).fillna(0)

In [253]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0